/* 

Задача:
Написати функцыю, яка робить кожне слово у переданому рядку з великої літери

('test testovich'); // Test Tetovich

Декомпозиція:

1. Розділити рядок на слова (split)
2. Зробити першу літеру кожного слова великою
- пройтись циклом по кожному елемнту масиву слів
- першу літеру слова (charAt) зробити великою буквою (toUpperCase)
- використати метод slice(1) для отримання підрядку, що починается з другого символу слова
- об'єднати першу велику літеру з рештою слоа, використовуючи оператор *
3. З'єднати слова знову в рядок
- використати метод join('') для з'єднання слів масиву в один рядок, розділенних пробілом
4. Повернути новий рядок з великими літерами слів

*/

function capitalizeWords(str) {
    const words = str.split(' ');

    for (let i = 0; i < words.length; i++) {
        words[i] = words[i].charAt(0).toUpperCase() + words[i].slice(1);
    }

    return words.join(' ');
}

// capitalizeWords('hello worl 1113')
// 'Hello Worl 1113'